2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/МК_ЗаявленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявленияСотрудников</name>
  <attributes>
    <name>МК_ВидЗаявления</name>
    <type>
      <types>CatalogRef.МК_НастройкиСвязиЗаявленийКЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПодписанияОчередногоУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявкиНаОтсутствие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставРоли</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписант</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Enums/МК_СтатусыЗаявлений/МК_СтатусыЗаявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыЗаявлений</name>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Недействителен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Enums/МК_ДействияСЗаявлениями/МК_ДействияСЗаявлениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_ДействияСЗаявлениями</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Получать</name>
  </enumValues>
  <enumValues>
    <name>НеПолучать</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Enums/МК_ОбрабатываемыеВидыДокументовПоЗаявлениям/МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</name>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Enums/МК_СтатусыПодписания/МК_СтатусыПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыПодписания</name>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ВОжидании</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_НастройкиСвязиЗаявленийКЭДО/МК_НастройкиСвязиЗаявленийКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_НастройкиСвязиЗаявленийКЭДО</name>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодШаблона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияСЗаявлениями</name>
    <type>
      <types>EnumRef.МК_ДействияСЗаявлениями</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/ManagerModule.bsl
&НаСервере
Функция ПолучитьИОбработатьЗаявленияИзМК()    Экспорт  
	мВозврат = Новый Структура("Результат,ТекстОшибки",Истина);   
	мСписокНезавершенных = ПолучитьСписокНезавершенных();
	мЗапрос = ЗапросЗаявленийИзМК(мСписокНезавершенных,1);    
	Если мЗапрос.Результат Тогда
		мСписок = мЗапрос.СписокЗаявлений;
		мколвоСтр = мЗапрос.Страницы.totalPages; 	 
		мИндекс = 0;
		мСписокКОтправке = Новый Массив;                   
		мСписокСсылок = Новый Массив;
		Пока мИндекс < мКолвоСтр Цикл
			Если мИндекс > 0 Тогда
				мЗапрос = ЗапросЗаявленийИзМК(мСписокНезавершенных,мИндекс+1);     
				мСписок = мЗапрос.СписокЗаявлений;
			КонецЕсли;	
			Для Каждого мЭлемент Из мСписок Цикл
				// Первая задача - разобрать мЭлемент по реквизитам, каждый - определить в 1С и если все хорошо, записать событие в 
				// справочник МК_ЗаявленияСотрудников
				мСсылка = РазобратьЗаявление(мЭлемент); 
				Если Не мСсылка = Неопределено Тогда  
					мСписокСсылок.Добавить(мСсылка);
					мСписокКОтправке.Добавить(мСсылка.МК_КодЗаявления);
				КонецЕсли;	
			КонецЦикла;	  
			мИндекс = мИндекс + 1;
		КонецЦикла;
		Если мСписокКОтправке.Количество() > 0 Тогда
			мРез = ОтправитьСписокЗаявлений(мСписокКОтправке);   	
			Если Не мРез.Результат Тогда           
				мВозврат.Результат = Ложь; 
				мВозврат.ТекcтОшибки = мРез.ТекстОшибки;
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		мВозврат.Результат = Ложь; 
		мВозврат.ТекстОшибки = мЗапрос.ТекстОшибки;
	КонецЕсли;
	Возврат мВозврат;
КонецФункции

Функция ПолучитьСписокНезавершенных()   
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   МК_КодЗаявления
        |ИЗ
        |   Справочник.МК_ЗаявленияСотрудников КАК мЗаявления
        |ГДЕ
        |   мЗаявления.СтатусЗаявления =  ЗНАЧЕНИЕ(Перечисление.МК_СтатусыЗаявлений.НаПодписании) 
		|   ИЛИ мЗаявления.СтатусЗаявления =  ЗНАЧЕНИЕ(Перечисление.МК_СтатусыЗаявлений.НаИсполнении)
		|   ИЛИ мЗаявления.СтатусЗаявления =  ЗНАЧЕНИЕ(Перечисление.МК_СтатусыЗаявлений.Просрочен)";
	    //|   ИЛИ мЗаявления.СтатусЗаявления =  ЗНАЧЕНИЕ(Перечисление.МК_СтатусыЗаявлений.Выполнен)";
 
    РезультатЗапроса = Запрос.ВыполнитьПакет();
 
    мВыборка = РезультатЗапроса[0].Выбрать();
	
	мВозврат = Новый Массив;           
	Пока мВыборка.Следующий() Цикл
		мВозврат.Добавить(мВыборка.МК_КодЗаявления);
	КонецЦикла;	
	                    
	Возврат мВозврат;   
КонецФункции	

&НаСервере
Функция ЗапросЗаявленийИзМК(мСписокНезавершенных, мСтраница)                   
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Структура("Результат,СписокЗаявлений,Страницы,ТекстОшибки",Ложь);   
	мТело = Новый Структура;       	
	мТело.Вставить("Ids",мСписокНезавершенных);
	мТело.Вставить("page", мСтраница);
	//мТело.Вставить("perPage", 4);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мТело);	
		ТекстJSON = ЗаписьJSON.Закрыть();  
		
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/applications", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON);    
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				Если СтрОтвет.data.status = "success" Тогда   // Если успех, надо перерисовать подписантов  
					мВозврат.Результат = Истина;
					мВозврат.СписокЗаявлений = СтрОтвет.Data.Applications;	
					мВозврат.Страницы = СтрОтвет.Data.pagination;	
				Иначе     // Тут какая=то ошибка. Она в массиве error 
					мОшибка = "";					
					Для Каждого мСтрока Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + мСтрока;
					КонецЦикла;						
				КонецЕсли;	
			КонецЕсли; 			
		Исключение   
			мОшибка = "Ошибка получения заявлений. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
		КонецПопытки; 						
	КонецЕсли;	                                   
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции    



Функция РазобратьЗаявление(мЭлемент) 
	// Что должно быть в заявлении.
	// id               + - Код заявления из МК   
	// type_id          + - Тип заявления. Найти в справочнике МК_НастройкиСвязиЗаявленийКЭДО 
	// status           + - Статус завяления. Может быть signing - На подписании, expired - Просрочен, completed - Выполнен, rejected - Отклонен, invalid - Недействителен 
    //                      надо сопоставить с перечислением МК_СтатусыЗаявлений (еще не создано)
	// date_created     + - Дата создания
	// user_ id         + - ID сотрудника - инициатора заявления. Пока непонятно именно сотрудника или физлица
	// file_path        + - Путь до PDF-файла заявления на сервере МК. Надо отрезать начало.
	// approvals        + - Массив участников маршрута   
	//   id	            + - Идентификатор участника. Число  
	//   name	        + - Имя участника. Строка. Содержит или ФИО или название роли в МК
	//   type	        + - Тип сущности. Возможные типы: user - сотрудник, role - роль
    //   type_signature + - Тип подписи: qes - УКЭП, nqes - УНЭП, none - не нужна
    //   user_ids       + - Массив идентификаторов физлиц - подписантов. Если тип user, то всегда один элемент, если role, то много
	//   status	        + - Статус подписания участника маршрута: 
	//                      На подписании - signing, На согласовании - agreement, Просрочен - expired, Подписан - completed, Согласован -  confirmed / agreed, Отклонен — rejected, В ожидании -  waiting
    //   pointer        + - Булево. Доступно ли текущему участнику маршрута подписание заявления    
	// custom_fields    + - Массив "кастомных" полей. На самом деле поля предопределенные: дата создания, дата начала, дата окончания, описание. Пример: "code": "date_start", "value": "01.01.2026"
    // division_id      + - ID организации ??? 
	// absence_id       + - Код заявки на отсутствие - основания для заявления. Может отсутствовать
	
	
	// Возвращаем: если все нормально определилось - IDДокументаМК, иначе- Неопределено. 
	мВозврат = Неопределено;
	мОшибка = Ложь;               
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСтрока = Новый Структура("Сотрудник, Организация, МК_ВидЗаявления, ДатаСоздания, 
				              | ДатаНачалаОтсутствия,Комментарий,ДатаЗавершенияОтсутствия,КодЗаявленияМК,					
							  | ВидДокумента1С, СтатусЗаявления, ПутьКФайлу, КодЗаявки, Подписанты, МК_ТипДокумента");
	Если мЭлемент.Свойство("user_id") Тогда   
		Если Не (мЭлемент.user_id = Неопределено) Тогда
			мСтрока.Сотрудник = ОО.НайтиСотрудника(мЭлемент.user_id);   
			Если мСтрока.Сотрудник = Неопределено Тогда
				мОшибка = Истина;
			КонецЕсли
		Иначе	
			мОшибка = Истина;
		КонецЕсли;		
	Иначе          
		мОшибка = Истина;
	КонецЕсли;	
	Если мОшибка = Ложь Тогда //  И мЭлемент.Свойство("division_id") Тогда
		//Если Не (мЭлемент.division_id = Неопределено) Тогда
		//	мСтрока.Организация = НайтиОрганизацию(мЭлемент.division_id);   
		//	Если мСтрока.Организация = Справочники.Организации.ПустаяСсылка() Тогда
		//		мОшибка = Истина;
		//	КонецЕсли;
		//Иначе	                 
		//	мОшибка = Истина;
		//КонецЕсли;
		мСтрока.Организация = мСтрока.Сотрудник.ГоловнаяОрганизация;  // Пока не смотрим на организацию из МК.
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                            
	Если мОшибка = Ложь И мЭлемент.Свойство("id") Тогда
		мСтрока.КодЗаявленияМК = мЭлемент.id; 
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	
	Если мОшибка = Ложь И мЭлемент.Свойство("type_id") Тогда		
		мСтрока.МК_ТипДокумента = Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID", Строка(мЭлемент.type_id));
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	
	Если мОшибка = Ложь И мЭлемент.Свойство("template_id") Тогда
		мСтрока.МК_ВидЗаявления = Справочники.МК_НастройкиСвязиЗаявленийКЭДО.НайтиШаблон(мЭлемент.template_id); 
		Если мСтрока.МК_ВидЗаявления = Неопределено Тогда			
			мОшибка = Истина;                            
		Иначе	
			Если мСтрока.МК_ВидЗаявления.ДействияСЗаявлениями = Перечисления.МК_ДействияСЗаявлениями.Получать Тогда
				Если ЗначениеЗаполнено(мСтрока.МК_ВидЗаявления.ВидДокумента1С) Тогда
					Если мСтрока.МК_ВидЗаявления.ВидДокумента1С = Перечисления.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Отпуск Тогда
						мСтрока.ВидДокумента1С = мСтрока.МК_ВидЗаявления.ВидОтпуска;
					Иначе                       
						мСтрока.ВидДокумента1С = мСтрока.МК_ВидЗаявления.ВидДокумента1С;
					КонецЕсли;	                                                        
				КонецЕсли;	
			Иначе	
				мОшибка = Истина;                            
			КонецЕсли;	
		КонецЕсли;	
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	     
	Если мОшибка = Ложь И мЭлемент.Свойство("status") Тогда
		мСтрока.СтатусЗаявления = ПолучитьСтатусЗаявления(мЭлемент.status); 
		Если мСтрока.СтатусЗаявления = Неопределено Тогда
			мОшибка = Истина;
		КонецЕсли;	
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	

	//Если мОшибка = Ложь И мЭлемент.Свойство("is_full") Тогда
	//	мСтрока.Целосменный = мЭлемент.is_full;
	//Иначе                
	//	мОшибка = Истина;
	//КонецЕсли;	                               
	Если мОшибка = Ложь И мЭлемент.Свойство("date_created") Тогда
		мСтрока.ДатаСоздания = мДата(мЭлемент.date_created);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                             
	//Если мОшибка = Ложь И мЭлемент.Свойство("absence_type_id") Тогда
	//	мСтрока.МК_КодВидаОтсутствия = мЭлемент.absence_type_id; 
		// Надо определить вид отсутствия в 1С
	//	мКод1С = Справочники.МК_СоответствиеОтсутствий.НайтиДокумент1С(мСтрока.МК_КодВидаОтсутствия);
	//	Если мКод1С = Неопределено Тогда
	//		мОшибка = Истина;       
	//	Иначе
	//		мСтрока.ВидДокумента1С = мКод1С;
	//	КонецЕсли;	
	//Иначе                
	//	мОшибка = Истина;
	//КонецЕсли;	                    
		                    
    Если мОшибка = Ложь И мЭлемент.Свойство("date_start") Тогда
		мСтрока.ДатаНачалаОтсутствия = мДата(мЭлемент.date_start);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	   
	Если мОшибка = Ложь И мЭлемент.Свойство("date_end") Тогда
		мСтрока.ДатаЗавершенияОтсутствия = мДата(мЭлемент.date_end);
	Иначе                
		мОшибка = Истина;
	КонецЕсли; 
	 Если мОшибка = Ложь И мЭлемент.Свойство("description") Тогда
		мСтрока.Комментарий = мЭлемент.description;
	Иначе                
		мОшибка = Истина;
	КонецЕсли; 
	Если мОшибка = Ложь И мЭлемент.Свойство("absence_id") Тогда
		мСтрока.КодЗаявки = мЭлемент.absence_id;	
	КонецЕсли;
	//Если мОшибка = Ложь И мЭлемент.Свойство("is_group") Тогда
	//	мСтрока.Групповая = мЭлемент.is_group;
	//Иначе                
	//	мОшибка = Истина;
	//КонецЕсли;

                                                   
	//Если мОшибка = Ложь И мЭлемент.Свойство("value") Тогда
	//	Если мСтрока.Целосменный Тогда 
	//		мСтрока.КолвоДнейОтсутствия = мЭлемент.value;
	//	Иначе
	//		мСтрока.КолвоЧасовОтсутствия = мЭлемент.value;
	//	КонецЕсли;		        
	//Иначе                
	//	мОшибка = Истина;		
	//КонецЕсли;	   
	Если мОшибка = Ложь И мЭлемент.Свойство("file_path") Тогда
		мСтрока.ПутьКФайлу = мЭлемент.file_path;
	Иначе                
		мОшибка = Истина;
	КонецЕсли;  
	
	Если мОшибка = Ложь И мЭлемент.Свойство("approvals") Тогда  
		мСписок = мЭлемент.approvals;
		мСтрока.Подписанты = Новый Массив;
		Для Каждого мПодписант Из мСписок Цикл
			мНовый = Новый Структура("Номер, Имя, Тип, ТипПодписи, СоставРоли, Статус, ТекущийПодписант, МассивИмен");
			мНовый.Номер = мПодписант.id;
			мНовый.Имя = мПодписант.name;
			мНовый.Тип = мПодписант.type;
			мНовый.ТипПодписи = мПодписант.type_signature; 
			мНовый.СоставРоли = мПодписант.user_ids;
			мНовый.Статус = мПодписант.status;    
			мНовый.ТекущийПодписант = мПодписант.pointer;  
			Если мПодписант.Свойство("user_names") Тогда   
				мНовый.МассивИмен = мПодписант.user_names;
			КонецЕсли;	
			мСтрока.Подписанты.Добавить(мНовый);
		КонецЦикла;	
	Иначе                
		мОшибка = Истина;
	КонецЕсли;  

	
	Если мОшибка = Ложь  Тогда    // Все определилось хорошо
		// Теперь - записать заявление в справочник.
		мСсылка = ЗаписатьЗаявление(мСтрока,1,Неопределено);  // Может быть какая-то беда с тем, что заявление уже есть в базе.
		Если Не мСсылка = Неопределено Тогда
			//мВозврат = мСтрока.IDДокументаМК;
			мВозврат = мСсылка;
		КонецЕсли;	  	
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции	          

Функция НайтиОрганизацию(мID)                                                                
	мОргСсылка = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(мID)); 
	Возврат мОргСсылка;	                                                                 
КонецФункции

Функция ЗаписатьЗаявление(мЗаявление, мРежим, мЗ)  Экспорт    // мРежим: 1 - массовое получение заявлений, 2 - обработка ответа по изменяемому заявлению
	мНовый = Ложь;
	мРез = Неопределено;           
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСписокПодписантов = "";       // Это не совсем теперь состав роли. При параллельном подписании сюда надо включать всех, кто еще текущий. в т.ч. это могут быть и роли
	Если мРежим = 1 Тогда
		мСсылка = Справочники.МК_ЗаявленияСотрудников.НайтиПоРеквизиту("МК_КодЗаявления",мЗаявление.КодЗаявленияМК);     
		Если мСсылка.Пустая() Или мСсылка.ПометкаУдаления = Истина Тогда   //  Не нашли, можно добавлять
			НовыйЭлемент = Справочники.МК_ЗаявленияСотрудников.СоздатьЭлемент(); 
			мНовый = Истина;
		Иначе        
			НовыйЭлемент = мСсылка.ПолучитьОбъект();
		КонецЕсли;	
		//НовыйЭлемент.Наименование = мЗаявка.МК_КодВидаОтсутствия;  
		НовыйЭлемент.Сотрудник = мЗаявление.Сотрудник;  
		НовыйЭлемент.Организация = мЗаявление.Организация; 
		НовыйЭлемент.МК_ВидЗаявления = мЗаявление.МК_ВидЗаявления;
		НовыйЭлемент.ДатаСоздания = мЗаявление.ДатаСоздания; 	
		НовыйЭлемент.ДатаНачала = мЗаявление.ДатаНачалаОтсутствия;		
		//НовыйЭлемент.КолвоДнейОтсутствия = мЗаявка.КолвоДнейОтсутствия;  
		НовыйЭлемент.Описание = мЗаявление.Комментарий;       
		
		//НовыйЭлемент.КолвоЧасовОтсутствия= мЗаявка.КолвоЧасовОтсутствия; 
		//НовыйЭлемент.Целосменный = мЗаявка.Целосменный; 
		//НовыйЭлемент.ВидДокумента1С = мЗаявка.ВидДокумента1С; 
		НовыйЭлемент.СтатусЗаявления = мЗаявление.СтатусЗаявления;
		НовыйЭлемент.МК_КодЗаявления = мЗаявление.КодЗаявленияМК;     
		НовыйЭлемент.МК_ПутьКФайлу = ПолучитьИмяФайла(мЗаявление.ПутьКФайлу); 
		//НовыйЭлемент.Наименование = НовыйЭлемент.МК_ПутьКФайлу;
		НовыйЭлемент.Наименование = мЗаявление.МК_ВидЗаявления.Наименование;
		НовыйЭлемент.ДатаОкончания = мЗаявление.ДатаЗавершенияОтсутствия;  			    		
		НовыйЭлемент.МК_КодЗаявкиНаОтсутствие = мЗаявление.КодЗаявки;  			    		
		НовыйЭлемент.ТипДокумента1С = мЗаявление.ВидДокумента1С;
		НовыйЭлемент.ВидДокументаМК = мЗаявление.МК_ТипДокумента;
		//НовыйЭлемент.Групповая = мЗаявка.Групповая;   
		//НовыйЭлемент.ДатаПолученияВ1С = ТекущаяДата();    
	Иначе     
		НовыйЭлемент = мЗ.ПолучитьОбъект();                       
		НовыйЭлемент.СтатусЗаявления = мЗаявление.СтатусЗаявления;
	КонецЕсли;	
		Если не мНовый Тогда  // Очистим табличную часть
			НовыйЭлемент.Подписанты.Очистить();	
			НовыйЭлемент.СоставРоли.Очистить();	
		КонецЕсли;	
		Для Каждого мПодписант Из мЗаявление.Подписанты Цикл
			мНоваяСтрока = НовыйЭлемент.Подписанты.Добавить();
			мНоваяСтрока.Имя = мПодписант.Имя;
			мНоваяСтрока.Номер = мПодписант.Номер;            
			Если мПодписант.Тип = "role" Тогда
				мНоваяСтрока.Тип = "Роль";
				мСоставРоли = "";       
				мИндекс = 0;
				Для Каждого мУчастник Из мПодписант.СоставРоли Цикл   
					мФИО = Неопределено;
					Если Не (мУчастник = Неопределено) Тогда   
						мФЛ = ОО.НайтиФЛ(мУчастник); 
						Если НЕ мФЛ = Неопределено Тогда
							мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы; 
						КонецЕсли;	                               
					КонецЕсли;
					Если мФИО = Неопределено И НЕ (мПодписант.МассивИмен = Неопределено) Тогда
					  	// Физлицо не найдено. Нужно достать ФИО из другого массива.						
						мФИО = "[" + мПодписант.МассивИмен[мИндекс] + "]";     
					ИначеЕсли мПодписант.ТекущийПодписант Тогда					// Сохранять будем только текущих подписантов. Нужны реально только они.
						мНоваяРоль = НовыйЭлемент.СоставРоли.Добавить();
						мНоваяРоль.Номер = мПодписант.Номер;
						мНоваяРоль.Подписант = мФЛ;
					КонецЕсли;	                                                          					
					Если НЕ ПустаяСтрока(мСоставРоли) Тогда
						мСоставРоли = мСоставРоли + ", " ;
					КонецЕсли;							
					мСоставРоли = мСоставРоли + мФИО;
					мИндекс = мИндекс + 1;
				КонецЦикла;	                              
				мНоваяСтрока.СоставРоли = мСоставРоли;
				Если мПодписант.ТекущийПодписант Тогда	
					Если НЕ ПустаяСтрока(мСписокПодписантов) Тогда
						мСписокПодписантов = мСписокПодписантов + ", " ;
					КонецЕсли;							                 
					мСписокПодписантов = мСписокПодписантов + мСоставРоли;
					НовыйЭлемент.Роль = мСписокПодписантов;
				КонецЕсли;	
			Иначе	                      
				мНоваяСтрока.Тип = "";    
				Если мПодписант.ТекущийПодписант Тогда
					мФЛ = ОО.НайтиФЛ(мПодписант.СоставРоли[0]); 
					Если мФЛ = Неопределено Тогда
						мФИО = "[" + мПодписант.Имя + "]";  
						мНоваяСтрока.Имя = мФИО;
					Иначе
						мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы;        
						мНоваяРоль = НовыйЭлемент.СоставРоли.Добавить();
						мНоваяРоль.Номер = мПодписант.Номер;
						мНоваяРоль.Подписант = мФЛ;                     
					КонецЕсли;					
					Если НЕ ПустаяСтрока(мСписокПодписантов) Тогда
						мСписокПодписантов = мСписокПодписантов + ", " ;
					КонецЕсли;							  
					мСписокПодписантов = мСписокПодписантов + мФИО;
					НовыйЭлемент.Роль = мСписокПодписантов;
					НовыйЭлемент.ТекущийПодписант = мФЛ; 					
				КонецЕсли;	
			КонецЕсли; 
			Если мСписокПодписантов = "" Тогда // Это значит, что уже нет действующих подписантов, все завершилось. Ставят задачу показать последнего  
				мИндекс = НовыйЭлемент.Подписанты.Количество() - 1;
				мПоследний = НовыйЭлемент.Подписанты[мИндекс];
				Если мПоследний.Тип = "Роль" Тогда 
					НовыйЭлемент.Роль = мПоследний.СоставРоли;
				Иначе                                         
					НовыйЭлемент.Роль = мПоследний.Имя;
				КонецЕсли;	
			КонецЕсли;	
			Если мПодписант.ТипПодписи = "qes" Тогда
				мНоваяСтрока.ТипПодписи = "УКЭП";
			ИначеЕсли мПодписант.ТипПодписи = "nqes" Тогда
				мНоваяСтрока.ТипПодписи = "УНЭП";	
			ИначеЕсли мПодписант.ТипПодписи = "none" Тогда
				мНоваяСтрока.ТипПодписи = "Без подписи";
			КонецЕсли;	
			мНоваяСтрока.Статус = ПолучитьСтатусПодписания(мПодписант.Статус);			
			мНоваяСтрока.ТекущийПодписант = мПодписант.ТекущийПодписант;
		КонецЦикла;
		Попытка
			НовыйЭлемент.Записать();  
			мРез = НовыйЭлемент.Ссылка;
		Исключение    		
			//мРез = Ложь;
		КонецПопытки;	               
	Возврат мРез;
КонецФункции	    

&НаСервере
Функция СкачатьФайлНаСервере(мФайл, мРежим)  Экспорт     
	// мРежим: 1 - вернуть PDF, 2 - вернуть двоичные данные	
	мВозврат = Неопределено;	
	ОО = Обработки.МК_НастройкаВыгрузки.Создать(); 
	мСеанс = ОО.СоздатьСеансСвязи(Истина);         
	Если мСеанс = Неопределено Тогда
 		// Ошибка авторизации. Ничего не отправляем.
	Иначе    		
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		
		hЗапрос = ОО.СоздатьHTTPЗапрос(мФайл, мСеанс);
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");		
		Ответ = мСеанс.Соединение.Получить(hЗапрос);       
		ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные(); 
		Если мРежим = 1 Тогда
			ПотокФайлPDF = ДвоичныеДанные.ОткрытьПотокДляЧтения();     
			PDF = Новый ДокументPDF(); 		
			Попытка 	
				PDF.Прочитать(ПотокФайлPDF);   
			Исключение
 				Сообщить("Не удалось прочитать PDF файл: " + ОписаниеОшибки());
			КонецПопытки;
			мВозврат = PDF;
		Иначе 
			мВозврат = ДвоичныеДанные;
		КонецЕсли	
	КонецЕсли;		 
	Возврат мВозврат;
КонецФункции


Функция ПолучитьИмяФайла(мПутьКФайлу)  Экспорт     	
	// Из МК приходит полное имя с указанием сервера и т.д. А мне нужно имя начиная с "/storage/edms/applications/" и т.д.
	// Поэтому нужно откусить начало. 
	мДлина = СтрДлина(мПутьКФайлу);
	мИндекс = СтрНайти(мПутьКФайлу, "/storage/edms/applications/"); 
	Возврат Прав(мПутьКФайлу, мДлина - мИндекс+1);
КонецФункции                                

Функция ПолучитьСтатусПодписания(мКод) Экспорт
	мВозврат = Неопределено;
	Если мКод = "signing" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.НаПодписании;
	ИначеЕсли мКод = "agreement" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.НаСогласовании;	
	ИначеЕсли мКод = "expired" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.Просрочен;
	ИначеЕсли мКод = "completed" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.Подписан;
	ИначеЕсли мКод = "confirmed" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.Согласован;	
	ИначеЕсли мКод = "agreed" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.Согласован;		
	ИначеЕсли мКод = "rejected" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.Отклонен;		
	ИначеЕсли мКод = "waiting" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.ВОжидании;		
	ИначеЕсли мКод = "execution" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписания.НаИсполнении;	 
	ИначеЕсли мКод = "fulfilled" Тогда                               
		мВозврат = Перечисления.МК_СтатусыПодписания.Исполнен;	 
	КонецЕсли;
	Возврат мВозврат;
КонецФункции	   

Функция ПолучитьСтатусЗаявления(мКод) Экспорт
	мВозврат = Неопределено;
	Если мКод = "signing" Тогда
		мВозврат = Перечисления.МК_СтатусыЗаявлений.НаПодписании;		
	ИначеЕсли мКод = "expired" Тогда
		мВозврат = Перечисления.МК_СтатусыЗаявлений.Просрочен;
	ИначеЕсли мКод = "completed" Тогда
		мВозврат = Перечисления.МК_СтатусыЗаявлений.Выполнен;  		
	ИначеЕсли мКод = "rejected" Тогда
		мВозврат = Перечисления.МК_СтатусыЗаявлений.Отклонен;		
	ИначеЕсли мКод = "invalid" Тогда
		мВозврат = Перечисления.МК_СтатусыЗаявлений.Недействителен;	
	ИначеЕсли мКод = "execution" Тогда
		мВозврат = Перечисления.МК_СтатусыЗаявлений.НаИсполнении;		
	КонецЕсли;
	Возврат мВозврат;
КонецФункции	   


&НаСервере
Функция ОтправитьСписокЗаявлений(мСписок)                      
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);  
	мВозврат = Новый Структура("Результат,ТекстОшибки",Ложь); 
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		
		мВыгрузка = Новый Структура;  
		мВыгрузка.Вставить("Application_Ids",мСписок);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();   	  	                                          
		hЗапрос = ОО.СоздатьHTTPЗапрос("api/1c-exchange/edms/applications/mark-exported", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON);   
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     					
				Если СтрОтвет.data.status = "success" Тогда   // Если успех, надо перерисовать подписантов  
					мВозврат.Результат = Истина;					
				Иначе     // Тут какая=то ошибка. Она в массиве error 
					мОшибка = "";					
					Для Каждого мСтрока Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + мСтрока;
					КонецЦикла;	
					мВозврат.ТекстОшибки = мОшибка;
				КонецЕсли;	
			КонецЕсли;	                                                                    
		Исключение   
			мОшибка = "Ошибка отправки списка записанных заявлений. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  			
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

Функция мДата(мСтрока) 
	мСтр = СтроковыеФункцииКлиентСервер.СтрокаВДату(мСтрока, "ДФ='Д.М.Г'");
	Возврат Дата(мСтр);
КонецФункции	

&НаСервере
Функция ИсполнитьОтклонитьНаСервере(мРежим,мПользователь,мМК_КодЗаявления, мНомерУчастника, мДокумент1С)      Экспорт
	мУспех = Ложь;
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты");   
	Если Не (мРежим = 3) Тогда
		мУчастник = Новый Структура("id, user_id, status, date"); 
		мУчастник.id = мНомерУчастника;
		мУчастник.user_id = СокрЛП(мПользователь.УникальныйИдентификатор());
		Если мРежим = 1 Тогда
			мУчастник.status = "completed";
		Иначе
			мУчастник.status = "rejected";
		КонецЕсли;          
		мУчастник.date = УниверсальноеВремя(ТекущаяДатаСеанса(), ЧасовойПоясСеанса());
	Иначе     
		мУчастник = Неопределено;
	КонецЕсли;	
	мТело = Новый Структура("id, status_1c,approval");
	мТело.id = мМК_КодЗаявления;
	мТело.status_1c = "";
	Если ЗначениеЗаполнено(мДокумент1С) Тогда
		мТело.status_1c = "created_document";
	КонецЕсли;
	мТело.approval = мУчастник;
	мЗапрос = Новый Структура("Application",мТело);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мЗапрос);	
		ТекстJSON = ЗаписьJSON.Закрыть();  
		
		hЗапрос = ОО.СоздатьHTTPЗапрос("api/1c-exchange/edms/applications/update-status", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     					
				Если СтрОтвет.data.status = "success" Тогда   // Если успех, надо перерисовать подписантов  
					мУспех = Истина;
				Иначе     // Тут какая=то ошибка. Она в массиве error 
					мОшибка = "";					
					Для Каждого мСтрока Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + мСтрока;
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения заявок. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
		КонецПопытки; 						
	КонецЕсли;	
	Если мУспех = Истина Тогда   // Если успех, надо перерисовать подписантов  
		мВозврат.Результат = Истина;   		
	Иначе
		мВозврат.ТекстОшибки = мОшибка;
		мВозврат.Результат = Ложь;                      		
	КонецЕсли;                                          
	мВозврат.Подписанты = СтрОтвет.data.application;
	Возврат мВозврат;

КонецФункции
